# AssemblyTypeName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssemblyInstance..::..AssemblyTypeName Property
AssemblyInstance Class See Also
---
The name for the assembly type. All matching assembly instances share this name. Unique assembly instances are named automatically based on their naming category.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public string AssemblyTypeName { get; set; }
```

Visual Basic
---
```text
Public Property AssemblyTypeName As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ AssemblyTypeName {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: This assembly type name is not valid for this assembly instance. An assembly type name should be non-empty, should contain valid characters, and should be unique for its naming category. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
AssemblyInstance Class
Autodesk.Revit.DB Namespace